doc/html/handlers/role.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Role Handler</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Role Handler"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 03:24:18 CDT"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="../stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Role Handler</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html">Elements</a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html"><b>Handlers</b></a> | <a href="../config.html">Configuration Options</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Role Handler</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Role Handler</h2>
<div class="outline-text-2" id="text-1">


<p>
  Roles in nitrogen have a specific meaning.  A user may have multiple roles,
  which will likely enable certain functionality of the site. It's analogous to
  a user having multiple groups associated with his/her Unix account.
</p>
<p>
  In Nitrogen, roles are accessed by the <code>wf:role</code> functions.
</p>
<p>
  The default role handler (like the default user handler), uses the Nitrogen
  session variables for tracking the roles.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Behavior Functions</h3>
<div class="outline-text-3" id="text-1-1">



</div>

<div id="outline-container-1-1-1" class="outline-5">
<h5 id="sec-1-1-1"><span class="section-number-5"></span> <code>init(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-1">


<p>
  Initialize the role handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code> 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-5">
<h5 id="sec-1-1-2"><span class="section-number-5"></span> <code>finish(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-2">


<p>
  Clean up the handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-3" class="outline-5">
<h5 id="sec-1-1-3"><span class="section-number-5"></span> <code>get_has_role(Role, Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-3">


<p>
  Checks to see if the current user has the specified role enabled for his/her
  session.
</p>
<ul>
<li><code>Role</code> - The role to check. Can be any erlang term.

</li>
<li><i>Return Value</i> - <code>true</code> or <code>false</code> depending on whether or not the user is
                     is in the specified role.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-4" class="outline-5">
<h5 id="sec-1-1-4"><span class="section-number-5"></span> <code>set_has_role(Role, IsInRole, Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-4">


<p>
  Sets the role status for a particular role for the current user
</p>
<ul>
<li><code>Role</code> - The role to set the status

</li>
<li><code>IsInRole</code> - The boolean <code>true</code> or <code>false</code>. <code>true</code> will enable the role for
                 the user, <code>false</code> will disabled the role on the user.

</li>
<li><i>Return Value</i> - {ok, NewState}
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-5" class="outline-5">
<h5 id="sec-1-1-5"><span class="section-number-5"></span> <code>get_roles(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-5">


<p>
  Retrieves the list of all roles currently enabled for the user.
</p>
<ul>
<li><i>Return Value</i> - The list of roles
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-6" class="outline-5">
<h5 id="sec-1-1-6"><span class="section-number-5"></span> = clear<sub>all</sub>(Config, State)=</h5>
<div class="outline-text-5" id="text-1-1-6">


<p>
  Clears all roles from the current user
</p>
<ul>
<li><i>Return Value</i> - {ok, NewState}
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Example</h3>
<div class="outline-text-3" id="text-1-2">


<p>
Here is the complete text of the default role handler
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span> (default_role_handler).
<span class="org-preprocessor">-behaviour</span> (role_handler).
<span class="org-preprocessor">-export</span> ([
    <span class="org-type">init/2</span>,
    <span class="org-type">finish/2</span>,
    <span class="org-type">get_has_role/3</span>,
    <span class="org-type">set_has_role/4</span>,
    <span class="org-type">get_roles/2</span>,
    <span class="org-type">clear_all/2</span>
]).
<span class="org-preprocessor">-define</span>(<span class="org-variable-name">KEY</span>, {default_role_handler, roles}).

<span class="org-function-name">init</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-function-name">finish</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-function-name">get_has_role</span>(<span class="org-variable-name">Role</span>, <span class="org-variable-name">_Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    <span class="org-variable-name">Roles</span> = <span class="org-type">wf</span>:<span class="org-type">session_default</span>(?<span class="org-constant">KEY</span>, []),
    <span class="org-type">lists</span>:<span class="org-type">member</span>(<span class="org-variable-name">Role</span>, <span class="org-variable-name">Roles</span>).

<span class="org-function-name">set_has_role</span>(<span class="org-variable-name">Role</span>, <span class="org-variable-name">IsInRole</span>, <span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-variable-name">Roles</span> = <span class="org-type">wf</span>:<span class="org-type">session_default</span>(?<span class="org-constant">KEY</span>, []),
    <span class="org-variable-name">Roles1</span> = <span class="org-variable-name">Roles</span> -- [<span class="org-variable-name">Role</span>],
    <span class="org-keyword">case</span> <span class="org-variable-name">IsInRole</span> <span class="org-keyword">of</span>
        true -&gt;<span class="org-function-name"> </span><span class="org-type">wf</span>:<span class="org-type">session</span>(?<span class="org-constant">KEY</span>, [<span class="org-variable-name">Role</span>|<span class="org-variable-name">Roles1</span>]);
        <span class="org-variable-name">_</span>    -&gt;<span class="org-function-name"> </span><span class="org-type">wf</span>:<span class="org-type">session</span>(?<span class="org-constant">KEY</span>, <span class="org-variable-name">Roles1</span>)
    <span class="org-keyword">end</span>,
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-function-name">get_roles</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    <span class="org-type">wf</span>:<span class="org-type">session_default</span>(?<span class="org-constant">KEY</span>, []).

<span class="org-function-name">clear_all</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-type">wf</span>:<span class="org-type">session</span>(?<span class="org-constant">KEY</span>, []),
    {ok, <span class="org-variable-name">State</span>}.

</pre>



</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li><a href="../handlers.html">Handler Overview</a>

</li>
<li><a href="../api.html#sec-9">API: Authentication and Authorization</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 03:24:18 CDT</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/handlers/role.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
